<!-- @format -->

<template>
	<p style="user-select: none">
		<strong>В этом приложении:</strong>
	</p>
	<ul class="md-body ul-st">
		<li>полная настройка шаблона на Vue CLI;</li>
		<li>установка и настройка Vue-router для Vue.js 3;</li>
		<li>динамическая перерисовка без перезагрузки страницы;</li>
		<li>динамический навбар и ссылки;</li>
		<li>обработка несуществующих роутов;</li>
		<li>хеши и моды для роутера;</li>
		<li>настройка общего конфига.</li>
		<li>динамические маршруты</li>
		<li>установка своих тем поврех своего шаблона vue cli</li>
		<li>
			понимание того, как работают темы для фреймворков по типу Material UI
		</li>
		<li>критерии выбора библиотеки</li>
		<li>
			разбор библиотек и взгляд "изнутри". Полное понимание того, как пишутся
			библиотеки
		</li>
		<li>слайдер с персонажами</li>
		<li>работа с git</li>
	</ul>
	<p style="user-select: none">
		Сделано на курсе
		<a href="https://tocode.ru/courses/vuejs-3-s-nulya-do-rezultata/">
			"Vue.js 3 c нуля до результата"
		</a>
	</p>
</template>
